app/controllers/places_controller.rb

INSERT INTO "places" ("admission_price", "description", "photo_url", "title") VALUES (?, ?, ?, ?)
---
 def create
 	Place.create(title: params["title"],
 				 photo_url: params["photo_url"],
			 	 admission_price: params["admission_price"],
			 	 description: params["description"])

DELETE FROM "places" WHERE "places"."id" = 7
---
 def delete
 	Place.delete(params["id"])

SELECT  "places".* FROM "places"  WHERE "places"."id" = 7 LIMIT 1
---
 def edit
 	@place = Place.find_by(:id => params["id"])

SELECT  "places".* FROM "places"  WHERE "places"."id" = 7 LIMIT 1
UPDATE "places" SET "description" = ?, "photo_url" = ? WHERE "places"."id" = 7  [["description", "<p><p>  B\r\n<br /><br /> C\r\n<br /><br />  D\r\n<br /></p></p>"], ["photo_url", "http://media-cdn.tripadvisor.com/media/photo-l/02/6d/12/67/edge-walk-at-the-cn-tower.jpg"]]
---
 def update
 	@place = Place.find_by(:id => params["id"])
 	@place.update(title: params["title"],
 				 photo_url: params["photo_url"],
			 	 admission_price: params["admission_price"],
			 	 description: params["description"])

SELECT  "places".* FROM "places"  WHERE "places"."id" = 7 LIMIT 1
---
 def show
    @place = Place.find_by(:id => params["id"])